{
    "heading": [
        "In the middle of winter a man stumbles    into the party. He thrusts a paper into one of their hands saying to keep it safe.",
        "In the spring time as the snow melts one of the party members uncovers a secret.",
        "Summer time is always hot, unfortunately this summer is not like the last. snow still covers the ground.",
        "Talk of war has been whispered for the past year. It will break out any moment.",
        "The wilds lands beyond the borders of the kingdom promise new riches and a new life for those who wish to leave their old one behind.",
        "Shadows have been seen in the woods, people are starting to disappear at night.",
        "No one likes their jobs, but it is the only way to stay alive.",
        "The king is offering a great reward for adventurers who are able to bring back something special for him.",
        "The baron has a secret that has been buried deep in the earth. Unfortunately when he went looking for it again it was no where to be found. Only foot steps leading away.",
        "Adventuring has always been the best way to make a fortune. Those few that survive live a lavish lifestyle."
    ],
    "response": [
        "Click for new campaign."
    ],
    "template": [
        "The players are @occupationpl looking for @lookingFor. On their way they meet @mentor. They @help. But, @tragedy. The party learns that @evilIntroduction. It all culminates @bossFight.",
        "The players are @occupationpl looking for @lookingFor. @evilIntroduction. While fleeing they meet @mentor. But, @tragedy. The final battle happens @bossFight.",
        "@Calltoadventure @Supernaturalaid @ThresholdGuardian @Helper @Mentor @ChallengesandTemptations @Helper @Revelation @Abyssofdeathandrebirth @Atonement @Return"
    ],
    "Calltoadventure": [
        "The party comes together at the death of an acquaintance. Their last will and testament names them the beneficiary of their estate in a far off dangerous land.",
        "A wizard saves the party from a monster attack they were loosing. At the end of the fight the wizard offers to take them to train at his college.",
        "The party's village is burnt to the ground while they are hunting in the forest. When they come back there is a troop of soldiers saddling up. They invite the party to come with them to hunt down those that destroyed everything they know."
    ],
    "Supernaturalaid": [
        "A powerful cleric offers a blessing to aid them on their way.",
        "A wizard teaches them a magic spell to help them when things feel hopeless.",
        "A celestial offers an hour of service because of the valor they have seen."
    ],
    "ThresholdGuardian": [
        "At the start of their journey a great beast blocks the only path.",
        "A sorcerer requires a test of strength to enter their domain.",
        "A druid requires a magical item from a shrine."
    ],
    "Helper":[
        "A young druid volunteers to follow along and help.",
        "A young page eagerly comes along to help if they can.",
        "While the party is lost a friendly fey offers to guide them to the path again.",
        "A talking animal lets the party know of a new way through their difficulties.",
        "An old friend meets up with the party and shows an alternative out of their troubles.",
        "A old friend meets them on their journey and offers to back track and help them on their way." 
    ],
    "Mentor": [
        "A renowned fighter hears of their travels and offers to teach them about the ways of the blade.",
        "A skilled bard comes along to make a song of the adventure and teach them the lore of the land.",
        "A traveling merchant joins with the party and teaches them of the past great heroes."
    ],
    "ChallengesandTemptations": [
        "While traveling the party hears cries for help off the path.",
        "The path leads the party through difficult mountain passes filled with monsters",
        "A large monster chases the party into a cave system and they become lost.",
        "The party's mentor becomes sick after a fight and dies shortly afterwards"
    ],
    "Revelation": [
        "The party realize that their traveling companion is actually misdirecting them.",
        "The people who the had previously helped the party end up betraying them to their foes at a critical moment.",
        "One morning the party wakes and their money is gone along with a traveling companion."
    ],
    "Abyssofdeathandrebirth": [
        "After an unfair fight the party is thrown into a dungeon.",
        "A hunter who has been stalking the party reveals them selves and kills a traveling companion.",
        "The party's destination is ruined and over run with monsters."
    ],
    "Atonement": [
        "The party remembers a magical item that they were given and it helps them to overcome an obstacle.",
        "A party member's god reveals a new way ou tof their difficulties.",
        "The party comes across their enemies in a unguarded moment and are victorious."
    ],
    "Return": [
        "The party succeeds at their quest and are hailed as heroes throughout the land.",
        "The party return home with gold and jewels to spare.",
        "The party learn new skills and are able to teach others what they have learned."
    ],
    "monsterType": [
        "Abberation",
        "Beast",
        "Celestial",
        "Dragon",
        "Elemental",
        "Fey",
        "Fiend",
        "Giant",
        "Humanoid",
        "Monstrosity",
        "Ooze",
        "Plant",
        "Undead"
    ],
    "occupationpl": [
        "adventurers",
        "thieves",
        "bounty hunters",
        "hunters",
        "nobles",
        "minor nobles",
        "townsfolk",
        "peasants",
        "guards",
        "servants to a wizard",
        "slaves",
        "part of a wizard's tower",
        "treasure hunters",
        "archeologists",
        "hired muscle"
    ],
    "lookingFor": [
        "their mentor",
        "gold",
        "treasure",
        "a secret book",
        "a map to a treasure",
        "a map to a secret underground lair",
        "the last of a mystical beast",
        "their teacher",
        "their inheritance",
        "the lost treasure of a forgotten civilization",
        "a forgotten treasure hoard",
        "the book of secrets",
        "a powerful spellbook",
        "the lost amulet",
        "a magical set of armor",
        "a shard of elemental energy"
    ],
    "mentor": [
        "a wise old wizard who teaches them a magic spell",
        "a kindly woman who teaches them a magic spell",
        "an unlikely troll who teaches them a magic spell",
        "a skilled fighter who teaches them a magic spell",
        "a druid in the forest who teaches them a magic spell",
        "a wise old wizard who feeds them a magnificent dinner",
        "a kindly woman who feeds them a magnificent dinner",
        "an unlikely troll who feeds them a magnificent dinner",
        "a skilled fighter who feeds them a magnificent dinner",
        "a druid in the forest who feeds them a magnificent dinner",
        "a wise old wizard who gives them each a weapon",
        "a kindly woman who gives them each a weapon",
        "an unlikely troll who teaches them the value of friendship",
        "a skilled fighter who gives them each a weapon",
        "a druid in the forest who gives them each a weapon",
        "a wise old wizard who rescues them from a frightening animal",
        "a kindly woman who rescues them from a frightening animal",
        "an unlikely troll who rescues them from a frightening animal",
        "a skilled fighter who rescues them from a frightening animal",
        "a druid in the forest who rescues them from a frightening animal"
    ],
    "treasure": [
        "gold",
        "magical weapons",
        "a hidden book of secrets",
        "pocket lint",
        "a sword",
        "a suit of armor",
        "a portal to another plane",
        "gems"
    ],
    "tragedy": [
        "a party member is bitten by a werewolf",
        "a party member's loved one dies",
        "the path is washed out and a new way is needed",
        "the forest is overgrown and will take twice as long to get through",
        "a message comes that a character's loved one is dying",
        "during the night a thief steals all their money",
        "the reach their destination only to find it burnt to the ground",
        "their friend dies in combat",
        "their traveling companion is mortally wounded",
        "their traveling companion betrays them"
    ],
    "help": [
        "heal the party",
        "guide the party",
        "hide the party from their enemies",
        "write to a powerful person in the next town giving the party anything they need for the journey",
        "transport the party half way along their journey",
        "give the party supplies for the journey",
        "give the party a magic spellbook"
    ],
    "evilIntroduction": [
        "a beholder has been sending monsters after them",
        "an undead revenant is pursuing them",
        "an owlbear is pursuing them",
        "an orc tribe is pursuing them",
        "a devil is pursuing them",
        "an army is pursuing them",
        "an evil wizard has been watching them and plans to steal what they are after",
        "an necromancer has been watching them and plans to steal what they are after",
        "a bugbear has been watching them and plans to steal what they are after",
        "an pirate king has been watching them and plans to steal what they are after",
        "an sorcerer has been watching them and plans to steal what they are after",
        "an agent of darkness has been watching them and plans to steal what they are after",
        "the king has put a bounty on their heads and every man woman and child with a weapon is on the look out for them",
        "the queen has put a bounty on their heads and every man woman and child with a weapon is on the look out for them",
        "the baron has put a bounty on their heads and every man woman and child with a weapon is on the look out for them",
        "the baroness has put a bounty on their heads and every man woman and child with a weapon is on the look out for them",
        "their destination has been taken over by gnolls",
        "their destination has been taken over by aberrations",
        "their destination has been taken over by devils",
        "their destination has been taken over by duergar",
        "their destination has been taken over by bandits",
        "their destination has been taken over by a dragon",
        "their home town has been overrun by a hobgoblin and their clan",
        "their home town has been overrun by a bandits and their dogs",
        "their home town has been overrun by a devils and their slaves",
        "their home town has been overrun by a cultists and their prophet",
        "their home town has been overrun by a beasts from the forest",
        "a dragon has made a lair in the party's destination",
        "a beholder has made a lair in the party's destination",
        "a litch has made a lair in the party's destination",
        "a demon has made a lair in the party's destination",
        "a devil has made a lair in the party's destination",
        "an abomination has made a lair in the party's destination",
        "a necromancer has heard tale of their deeds and is setting a trap for them",
        "a wizard has heard tale of their deeds and is setting a trap for them",
        "a thief has heard tale of their deeds and is setting a trap for them",
        "a hobgoblin has heard tale of their deeds and is setting a trap for them",
        "a mindflayer has heard tale of their deeds and is setting a trap for them",
        "a drow has heard tale of their deeds and is setting a trap for them",
        "a gnome has heard tale of their deeds and is setting a trap for them"
    ],
    "bossFight": [
        "in the lair of a monstrous beast",
        "in the lair of a dragon",
        "at home fighting for their loves ones' freedom",
        "on a icy mountain peak struggling against the elements",
        "on a icy mountain peak fighting a dragon",
        "in a volcano struggling against the elements",
        "in a volcano fighting a dragon",
        "deep underground in the dark at the mouth of a portal",
        "deep underground in the dark with the echoing sounds of battle",
        "in a ruined temple to a forgotten god filled with gnolls",
        "in a ruined temple to a forgotten god filled with devils",
        "in a ruined temple to a forgotten god filled with demons",
        "in a ruined temple to a forgotten god filled with goblins",
        "in a ruined temple to a forgotten god filled with kobolds",
        "in a ruined temple to a forgotten god filled with traps",
        "in a ruined temple to a forgotten god filled with orcs",
        "in a ruined castle filled with orcs",
        "in a ruined castle filled with gnolls",
        "in a ruined castle filled with devils",
        "in a ruined castle filled with demons",
        "in a ruined castle filled with goblins",
        "in a ruined castle filled with kobolds",
        "in a ruined castle filled with traps",
        "in a ruined tower filled with orcs",
        "in a ruined tower filled with gnolls",
        "in a ruined tower filled with devils",
        "in a ruined tower filled with demons",
        "in a ruined tower filled with goblins",
        "in a ruined tower filled with kobolds",
        "in a ruined tower filled with traps",
        "in a town where everyone is suspicious of them",
        "in a town where everyone is suspicious of them",
        "out in the grassy plains exposed on all sides to enemies",
        "in the town center exposed on all sides to enemies",
        "running for their lives out of a mausoleum",
        "running for their lives out of a temple",
        "in a ruined temple that was sealed shut, not to keep people out, but to keep its occupant sealed in",
        "in a ruined shrine that was sealed shut, not to keep people out, but to keep its occupant sealed in"
    ],
    "animal": [
        "dog",
        "cat",
        "rabbit",
        "owlbear",
        "goblin",
        "orc",
        "dragon",
        "frog",
        "unicorn",
        "horse",
        "slug",
        "yeti",
        "troll",
        "ogre",
        "devil",
        "zombie",
        "skeleton",
        "werewolf",
        "owl",
        "giant beetle",
        "puppy"
    ],

    "loc": [
        "city",
        "town",
        "woods",
        "forest",
        "cave",
        "dungeon",
        "cave",
        "island",
        "tower",
        "inverted tower",
        "ship",
        "trail",
        "road",
        "castle",
        "light house",
        "magic shop",
        "black smithy",
        "local store",
        "well",
        "library",
        "catacombs"
    ],

    "syl": [
        "ile",
        "ake",
        "oke",
        "ude",
        "are",
        "tal",
        "val",
        "ble",
        "tor",
        "go",
        "so",
        "me",
        "ar",
        "er",
        "or",
        "ur",
        "yr",
        "ight",
        "ng",
        "dh",
        "te",
        "ka",
        "ke",
        "al",
        "el",
        "iz",
        "uz",
        "kud",
        "n",
        "g",
        "l",
        "s",
        "z",
        "k",
        "l",
        "p",
        "h",
        "ha",
        "au",
        ""
    ],

    "vowel": [
        "a",
        "e",
        "i",
        "o",
        "u",
        "y",
        "'",
        "oo",
        "ee",
        "yl",
        "",
        " "
    ],

    "cons": [
        "b",
        "c",
        "cs",
        "d",
        "dz",
        "dzs",
        "f",
        "g",
        "gy",
        "h",
        "j",
        "k",
        "l",
        "ly",
        "m",
        "n",
        "ny",
        "p",
        "qu",
        "r",
        "s",
        "ss",
        "sz",
        "t",
        "v",
        "w",
        "x",
        "z",
        "zs",
        "th",
        "tt",
        "ll",
        "ph",
        "gh",
        "kn",
        "",
        " "
    ],

    "monster": [
        "Ogre",
        "Demogorgon",
        "Orc",
        "owlbear",
        "goblin",
        "orc",
        "dragon",
        "Troll",
        "unicorn",
        "Purple Worm",
        "Orc Archer",
        "yeti",
        "troll",
        "ogre",
        "devil",
        "zombie",
        "skeleton",
        "werewolf",
        "Gelatinous cube",
        "Rust monster",
        "Lich",
        "Kobolds",
        "Illithid",
        "Gnoll",
        "Vampire",
        "Displacer Beast",
        "Umberhulk",
        "changeling",
        "Carrion Crawler",
        "Grick",
        "Grell",
        "Ooze",
        "Golem",
        "Hydra",
        "Gibbering Mouther",
        "Roper",
        "Drow",
        "Chuul",
        "Elemental",
        "Efreet",
        "Githyanki",
        "Brigand",
        "monk",
        "bandit",
        "Aboleth",
        "Black Dragon",
        "Red Dragon",
        "Blue Dragon",
        "Green Dragon",
        "Brass Dragon",
        "Copper Dragon",
        "Gold Dragon",
        "Silver Dragon",
        "White Dragon",
        "bronze Dragon",
        "crystal Dragon",
        "amethyst Dragon",
        "emerald Dragon",
        "sapphire Dragon",
        "topaz Dragon",
        "Beholder"
    ],

    "payment": [
        "handsomely",
        "100 gold",
        "500 gold",
        "2 copper",
        "travel expenses",
        "one slice cake and a birthday hat",
        "in magical components",
        "a rusty old key with a strange engraving",
        "10 gold",
        "20 gold",
        "30 gold",
        "40 gold",
        "50 gold",
        "60 gold",
        "70 gold",
        "80 gold",
        "90 gold",
        "200 gold",
        "300 gold",
        "400 gold",
        "600 gold",
        "in blood",
        "a dozen eggs",
        "an all inclusive trip to the ocean side"
    ],

    "person": [
        "the mayor",
        "the local thieves guild",
        "a child on the street",
        "An aspiring actor",
        "someone lurking in the shadows",
        "the town drunk",
        "a stranger who wandered into town",
        "the king",
        "an old woman",
        "the farmer's daughter",
        "A farmer",
        "The farmer's daughter's boyfriend",
        "the cook",
        "the local magic store owner",
        "the bar tender",
        "the black smith",
        "the wizard",
        "the mage",
        "the coachman",
        "the necromancer",
        "the old man in the woods",
        "the fisherman",
        "the woman in the tavern",
        "the house keeper",
        "the bounty hunter",
        "the huntress",
        "a local bard",
        "a traveling bard",
        "a fighter",
        "someone whispering at your table",
        "the girl sitting by the fountain",
        "the thief",
        "a dwarf",
        "an elf",
        "a guy with a sword"
    ],

    "feeling": [
        "Accepting",
        "Open",
        "Calm",
        "Centered",
        "Content",
        "Fulfilled",
        "Patient",
        "Peaceful",
        "Present",
        "Relaxed",
        "Serene",
        "Trusting",
        "Aliveness",
        "Joy",
        "Amazed",
        "Awe",
        "Bliss",
        "Delighted",
        "Eager",
        "Ecstatic",
        "Enchanted",
        "Energized",
        "Engaged",
        "Enthusiastic",
        "Excited",
        "Free",
        "Happy",
        "Inspired",
        "Invigorated",
        "Lively",
        "Passionate",
        "Playful",
        "Radiant",
        "Refreshed",
        "Rejuvenated",
        "Renewed",
        "Satisfied",
        "Thrilled",
        "Vibrant",
        "Angry",
        "Annoyed",
        "Agitated",
        "Aggravated",
        "Bitter",
        "Contempt",
        "Cynical",
        "Disdain",
        "Disgruntled",
        "Disturbed",
        "Edgy",
        "Exasperated",
        "Frustrated",
        "Furious",
        "Grouchy",
        "Hostile",
        "Impatient",
        "Irritated",
        "Irate",
        "Moody",
        "On",
        "edge",
        "Outraged",
        "Pissed",
        "Resentful",
        "Upset",
        "Vindictive",
        "Courageous",
        "Powerful",
        "Adventurous",
        "Brave",
        "Capable",
        "Confident",
        "Daring",
        "Determined",
        "Grounded",
        "Proud",
        "Strong",
        "Worthy",
        "Valiant",
        "Connected",
        "Loving",
        "Affectionate",
        "Caring",
        "Compassion",
        "Empathy",
        "Safe",
        "Warm",
        "Curious",
        "Exploring",
        "Fascinated",
        "Interested",
        "Intrigued",
        "Involved",
        "Stimulated",
        "Despair",
        "Sad",
        "Anguish",
        "Depressed",
        "Despondent",
        "Disappointed",
        "Discouraged",
        "Forlorn",
        "Gloomy",
        "Grief",
        "Heartbroken",
        "Hopeless",
        "Lonely",
        "Longing",
        "Melancholy",
        "Sorrow",
        "Teary",
        "Unhappy",
        "Weary",
        "Yearning",
        "Disconnected",
        "Numb",
        "Aloof",
        "Bored",
        "Confused",
        "Distant",
        "Empty",
        "Indifferent",
        "Isolated",
        "Lethargic",
        "Listless",
        "Removed",
        "Resistant",
        "Shut",
        "Down",
        "Uneasy",
        "Withdrawn",
        "Embarrassed",
        "Shame",
        "Ashamed",
        "Humiliated",
        "Inhibited",
        "Mortified",
        "Self-conscious",
        "Useless",
        "Weak",
        "Worthless",
        "Fear",
        "Afraid",
        "Anxious",
        "Apprehensive",
        "Frightened",
        "Hesitant",
        "Nervous",
        "Panic",
        "Paralyzed",
        "Scared",
        "Terrified",
        "Worried",
        "Fragile",
        "Helpless",
        "Sensitive",
        "Grateful",
        "Appreciative",
        "Blessed",
        "Fortunate",
        "Grace",
        "Humbled",
        "Lucky",
        "Moved",
        "Thankful",
        "Touched",
        "Guilt",
        "Regret",
        "Remorseful",
        "Sorry",
        "Hopeful",
        "Encouraged",
        "Expectant",
        "Optimistic",
        "Powerless",
        "Impotent",
        "Incapable",
        "Resigned",
        "Trapped",
        "Victim",
        "Tender",
        "Reflective",
        "Self-loving",
        "Vulnerable",
        "Stressed",
        "Tense",
        "Burned",
        "out",
        "Cranky",
        "Depleted",
        "Exhausted",
        "Frazzled",
        "Overwhelm",
        "Rattled",
        "Rejecting",
        "Restless",
        "Shaken",
        "Tight",
        "Worn",
        "Unsettled",
        "Doubt",
        "Concerned",
        "Dissatisfied",
        "Perplexed",
        "Questioning",
        "Reluctant",
        "Shocked",
        "Skeptical",
        "Suspicious",
        "Ungrounded",
        "Unsure"
    ],

    "looking": [
        "looking for",
        "searching for",
        "hunting for",
        "gathering up",
        "paying handsomely for",
        "screaming about",
        "hearings whisperings of",
        "reading in a dusty old book about",
        "talking loudly about",
        "talking in hushed tones about",
        "looking at a treasure map to",
        "whispering about",
        "sneaking out of town with"
    ],

    "activity": [
        "running around",
        "dancing",
        "puffing up",
        "rampaging through the city",
        "entering the kings court",
        "stopping to smell the roses",
        "threatening bystanders",
        "making a mess",
        "attacking people",
        "breathing fire",
        "totally wanting to kill something",
        "plotting something evil",
        "staring down the party",
        "flying around",
        "eating people",
        "singing",
        "sighing",
        "pondering",
        "roaring"
    ],

    "object": [
        "hat",
        "sword",
        "gem",
        "dragon jaw bone",
        "glass bauble",
        "statue",
        "amulet",
        "book",
        "scroll",
        "mace",
        "treasure chest",
        "bow and arrow set",
        "mug",
        "pet cat",
        "set of armor",
        "jar with a hand in it",
        "jar with magical essence in it",
        "healing potions",
        "skull",
        "scales",
        "wooden chest",
        "coin purse",
        "box",
        "booklet",
        "diadem",
        "flag",
        "banner",
        "lantern",
        "banner of the king",
        "wand",
        "spell book",
        "chandelier",
        "jacket",
        "cloak",
        "potion",
        "spear",
        "dagger",
        "rapier",
        "halberd",
        "cook book",
        "hammer",
        "long sword",
        "great axe",
        "rod",
        "ring",
        "broomstick",
        "a bouquet",
        "jewels"
    ],

    "description": [
        "red",
        "blue",
        "green",
        "yellow",
        "purple",
        "teal",
        "rainbow",
        "silver",
        "gold",
        "brown",
        "black",
        "bloody",
        "tiny",
        "huge",
        "intricately carved wood",
        "intricately carved stone",
        "intricately etched metal",
        "intricately engraved crystal",
        "intricately sculpted earthen",
        "roughly carved wood",
        "roughly carved stone",
        "roughly hammered metal",
        "roughly chiseled crystal",
        "roughly sculpted earthen",
        "expertly carved wood",
        "expertly carved stone",
        "expertly etched metal",
        "expertly engraved crystal",
        "expertly sculpted earthen",
        "terribly carved wood",
        "terribly carved stone",
        "terribly hammered metal",
        "terribly chiseled crystal",
        "terribly sculpted earthen",
        "wood",
        "stone",
        "metal",
        "crystal",
        "earthen",
        "massive",
        "diminutive",
        "smelly",
        "fine",
        "masterwork",
        "artifact",
        "fluffy",
        "undead",
        "soft",
        "weird",
        "odd",
        "dangerous",
        "magical"
    ],

    "odesc": [
        "red",
        "blue",
        "green",
        "yellow",
        "purple",
        "teal",
        "rainbow",
        "silver",
        "gold",
        "brown",
        "black",
        "bloody",
        "tiny",
        "huge",
        "massive",
        "diminutive",
        "smelly",
        "fine",
        "artifact",
        "fluffy",
        "undead",
        "soft",
        "weird",
        "odd",
        "dangerous",
        "brave",
        "beautiful",
        "brilliant",
        "dramatic"
    ],

    "color": [
        "Red",
        "Orange",
        "Yellow",
        "Green",
        "Blue",
        "Purple",
        "Brown",
        "Magenta",
        "Tan",
        "Cyan",
        "Olive",
        "Maroon",
        "Navy",
        "Aquamarine",
        "Turquoise",
        "Silver",
        "Lime",
        "Teal",
        "Indigo",
        "Violet",
        "Pink",
        "Black",
        "White",
        "Gray"
    ]
}